<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c13{margin-left:19.2pt;padding-top:12pt;text-indent:-19.2pt;padding-bottom:12pt;line-height:1.0;orphans:2;widows:2;text-align:left}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c15{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c11{padding-top:12pt;padding-bottom:12pt;line-height:1.16;orphans:2;widows:2;text-align:left}.c4{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c9{padding-top:12pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c5{margin-left:19.2pt;padding-top:0pt;text-indent:-19.2pt;padding-bottom:0pt;line-height:1.0;text-align:left}.c7{color:#000000;font-weight:700;text-decoration:none;font-family:"Arial";font-style:normal}.c1{vertical-align:baseline;font-size:12pt}.c8{vertical-align:baseline;font-size:13pt}.c14{max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c2{color:inherit;text-decoration:inherit}.c3{font-size:12pt}.c10{height:11pt}.c12{background-color:#ffffff}.c6{font-style:italic}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c12 c14 doc-content"><p class="c4"><span class="c7 c1">&#1051;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1072;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; 1</span></p><p class="c4"><span class="c7 c1">&#1060;&#1048;&#1054;</span></p><p class="c4"><span class="c0">&#1050;&#1086;&#1089;&#1072;&#1082;&#1103;&#1085; &#1043;&#1077;&#1088;&#1084;&#1072;&#1085; &#1040;&#1088;&#1090;&#1091;&#1088;&#1086;&#1074;&#1080;&#1095;,</span></p><p class="c4"><span class="c0">&#1048;&#1085;&#1086;&#1079;&#1077;&#1084;&#1094;&#1077;&#1074; &#1056;&#1086;&#1084;&#1072;&#1085; &#1042;&#1072;&#1083;&#1077;&#1088;&#1100;&#1077;&#1074;&#1080;&#1095;.</span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c1 c7">Topic</span></p><p class="c4"><span class="c0">SCADA System; Supervisory Control; Intrusion Detection</span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c7 c1">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;</span></p><p class="c11"><span class="c0 c12">Supervisory Control &#1101;&#1090;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1086;&#1074; &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1086;&#1074; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; SCADA, &#1072;&#1073;&#1073;&#1088;&#1077;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1072; &#1086;&#1090; Supervisory Control And Data Acquisition (&#1076;&#1080;&#1089;&#1087;&#1077;&#1090;&#1095;&#1077;&#1088;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1080; &#1089;&#1073;&#1086;&#1088; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;), &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;&#1084;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1086;. &#1042;&#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1080;&#1093; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084; &#1073;&#1099;&#1083;&#1086; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1076;&#1074;&#1091;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1077;&#1081; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1088;&#1072;&#1089;&#1090;&#1091;&#1097;&#1072;&#1103; &#1101;&#1089;&#1082;&#1072;&#1083;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1091; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089;&#1090;&#1072;&#1088;&#1091;&#1102; &#1087;&#1072;&#1088;&#1072;&#1076;&#1080;&#1075;&#1084;&#1091; &#1080; &#1087;&#1088;&#1080;&#1076;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1091; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1081; &#1082;&#1080;&#1073;&#1077;&#1088;&#1072;&#1090;&#1072;&#1082;&#1080;, &#1089;&#1090;&#1072;&#1074;&#1103;&#1097;&#1077;&#1081; &#1087;&#1086;&#1076; &#1091;&#1075;&#1088;&#1086;&#1079;&#1091; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; SCADA. &#1069;&#1090;&#1080; &#1072;&#1090;&#1072;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1072;&#1090;&#1088;&#1086;&#1085;&#1091;&#1090;&#1100; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076; &#1091;&#1075;&#1088;&#1086;&#1079;&#1091; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1099;. &#1044;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1080;&#1073;&#1077;&#1088;&#1072;&#1090;&#1072;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080;&#1083;&#1080; IDS (&#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1084; &#1103;&#1079;&#1099;&#1082;&#1077;) &mdash; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1080;&#1083;&#1080; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1082;&#1090;&#1086;&#1074; &#1085;&#1077;&#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1080;&#1083;&#1080; &#1089;&#1077;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1085;&#1077;&#1089;&#1072;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1080; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1048;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;.</span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c7 c1">&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; (Gap)</span></p><p class="c11"><span class="c0">&#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093;, &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089;&#1090;&#1072;&#1074;&#1103;&#1090; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080;&#1079;-&#1079;&#1072; &#1095;&#1077;&#1075;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1083;&#1072;&#1073;&#1086; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1084; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;.</span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c7 c1">&#1048;&#1076;&#1077;&#1103;</span></p><p class="c4"><span class="c3">&#1048;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1099; &#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c7 c1">&#1050;&#1088;&#1072;&#1090;&#1082;&#1080;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1073;&#1079;&#1086;&#1088;&#1072;</span></p><p class="c9"><span class="c3">&#1044;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1080;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1082;&#1072;&#1082;: &#1072;&#1090;&#1086;&#1084;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1080;, &#1090;&#1088;&#1091;&#1073;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1099;, &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1099; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1077;&#1085;&#1090;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080; &#1083;&#1105;&#1075;&#1082;&#1080;&#1093; - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; SCADA &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; </span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?M5iJHL&amp;sa=D&amp;source=editors&amp;ust=1710401839001471&amp;usg=AOvVaw1mf2rVl1RSZZIYs9zj33_Y">[1], [2]</a></span><span class="c3">. &#1057; &#1091;&#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088; &#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1072;, &#1076;&#1083;&#1103; &#1076;&#1080;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; SCADA &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1091;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1083;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1082;&#1080;&#1073;&#1077;&#1088;&#1072;&#1090;&#1072;&#1082;. &#1044;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1081; &#1074; SCADA &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; </span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?afsnPz&amp;sa=D&amp;source=editors&amp;ust=1710401839002043&amp;usg=AOvVaw2fd2QhKXP02QIpgAQtGhVS">[3], [4], [5]</a></span><span class="c3">. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1072;&#1082; &#1074; &#1082;&#1080;&#1073;&#1077;&#1088;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072; Nonparallel hyperplane </span><span class="c3"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?PoGoSn&amp;sa=D&amp;source=editors&amp;ust=1710401839002285&amp;usg=AOvVaw2PKdjcCV_tQaozYqr1PS1r">[10]</a></span><span class="c3">. &#1050;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; IDS &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; One-Class Support Vector Machine (OCSVM), &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; SCADA, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073; &#1072;&#1085;&#1086;&#1084;&#1072;&#1083;&#1080;&#1103;&#1093;. OCSVM &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; Intrusion Detection Message Exchange Format (IDMEF) </span><span class="c3"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?ER9kHY&amp;sa=D&amp;source=editors&amp;ust=1710401839002577&amp;usg=AOvVaw02sGEdSmicDMKDe9wQXHe0">[5]</a></span><span class="c3">. &#1042; &#1089;&#1090;&#1072;&#1090;&#1100;&#1077; Q. Fu &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1082;&#1080;&#1073;&#1077;&#1088;-&#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; SCADA &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1082;&#1088;&#1086;&#1084;&#1077; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1081; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1072;&#1077;&#1090; &#1086;&#1094;&#1077;&#1085;&#1082;&#1091; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1088;&#1080;&#1089;&#1082;&#1086;&#1074; &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1079;&#1072; &#1089;&#1095;&#1105;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1093; &#1072;&#1090;&#1072;&#1082;&#1072;&#1093; </span><span class="c3"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?qEF6Zb&amp;sa=D&amp;source=editors&amp;ust=1710401839002817&amp;usg=AOvVaw3pkuniPTCuhvvhFyKnQYBc">[11]</a></span><span class="c3">. &#1057; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080; &#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1093; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1074;&#1085;&#1077;&#1076;&#1088;&#1103;&#1090;&#1100; &#1074; IDS &#1076;&#1083;&#1103; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; </span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?9xwC0X&amp;sa=D&amp;source=editors&amp;ust=1710401839003114&amp;usg=AOvVaw33ha1-4RAOUJCKmEK1Cyde">[6], [7], [8], [9]</a></span><span class="c3">. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1087;&#1086;&#1090;&#1077;&#1088;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084;&#1080; &#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; </span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?g6i3WU&amp;sa=D&amp;source=editors&amp;ust=1710401839003429&amp;usg=AOvVaw3i6I1d4ZBibagwb8rDDDXL">[9]</a></span><span class="c3">. &#1058;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; hybrid model for anomaly-based intrusion detection &#1074; &#1089;&#1077;&#1090;&#1103;&#1093; SCADA, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1103; </span><span class="c3"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?3LgAVO&amp;sa=D&amp;source=editors&amp;ust=1710401839003683&amp;usg=AOvVaw23xnfoFTU0E61R-j_xUs6B">[6]</a></span><span class="c0">. &#1042; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077; &#1089;&#1090;&#1072;&#1090;&#1077;&#1081;, &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1077; &#1091;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1083;&#1089;&#1103;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1086;&#1081;, &#1082;&#1072;&#1082; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1074; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1084;&#1099; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1077; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082;. &#1054;&#1085;&#1086; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;. &#1054;&#1089;&#1086;&#1073;&#1086;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1084;&#1099; &#1091;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1103;&#1102;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; IDS &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1102; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1089;&#1085;&#1080;&#1078;&#1077;&#1085;&#1080;&#1102; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1093; &#1074;&#1090;&#1086;&#1088;&#1078;&#1077;&#1085;&#1080;&#1081;.</span></p><p class="c4 c10"><span class="c0"></span></p><p class="c11"><span class="c0">&nbsp;</span></p><p class="c4"><span class="c7 c8">References</span></p><p class="c13"><span class="c0">&nbsp;</span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839004536&amp;usg=AOvVaw3uQEcbx0SRbq_HT2vgDSL_">[1]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;J. Figueiredo &#1080; J. S&aacute; da Costa, &laquo;A SCADA system for energy management in intelligent buildings&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839004762&amp;usg=AOvVaw3k6Y7VPadJZwT-Edh4FYpJ">Energy Build.</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839004973&amp;usg=AOvVaw3RyFNyXpWQkWivCd2nydSU">, &#1090;. 49, &#1089;&#1089;. 85&ndash;98, &#1080;&#1102;&#1085;. 2012, doi: 10.1016/j.enbuild.2012.01.041.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839005266&amp;usg=AOvVaw3UumQ2yrEhcahBn5EStrPD">[2]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;G. Yadav &#1080; K. Paul, &laquo;Architecture and security of SCADA systems: A review&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839005480&amp;usg=AOvVaw2WxzPcMOa0QgfXT-b5XB0f">Int. J. Crit. Infrastruct. Prot.</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839005652&amp;usg=AOvVaw0TLJ0fnWmA8YJ5BvtjiHh_">, &#1090;. 34, &#1089;. 100433, &#1089;&#1077;&#1085;. 2021, doi: 10.1016/j.ijcip.2021.100433.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839005924&amp;usg=AOvVaw0OoEZV4jI19M2jiLnAwUEE">[3]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;H.-J. Liao, C.-H. Richard Lin, Y.-C. Lin, &#1080; K.-Y. Tung, &laquo;Intrusion detection system: A comprehensive review&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839006149&amp;usg=AOvVaw0NTb_FKsT_OeWfjmHMg8VI">J. Netw. Comput. Appl.</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839006403&amp;usg=AOvVaw2YCuZCgv8b6C1ZL5RenT-o">, &#1090;. 36, &#1074;&#1099;&#1087;. 1, &#1089;&#1089;. 16&ndash;24, &#1103;&#1085;&#1074;. 2013, doi: 10.1016/j.jnca.2012.09.004.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839006727&amp;usg=AOvVaw3rP2kPuJP9FaXtSXS2oPuq">[4]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A. Khraisat, I. Gondal, P. Vamplew, &#1080; J. Kamruzzaman, &laquo;Survey of intrusion detection systems: techniques, datasets and challenges&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839006926&amp;usg=AOvVaw23i03MOPUYzHAshXZxzrI7">Cybersecurity</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839007143&amp;usg=AOvVaw3tabn0_S4hjdjXzwHLmZXn">, &#1090;. 2, &#1074;&#1099;&#1087;. 1, &#1089;. 20, &#1076;&#1077;&#1082;. 2019, doi: 10.1186/s42400-019-0038-7.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839007529&amp;usg=AOvVaw0J0zdvWTFu2LfGKTYU-cOD">[5]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;L. A. Maglaras &#1080; J. Jiang, &laquo;Intrusion detection in SCADA systems using machine learning techniques&raquo;, &#1074; </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839007772&amp;usg=AOvVaw2IUasHSPTpKmyBQZapUqYy">2014 Science and Information Conference</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839007943&amp;usg=AOvVaw00RkFKLLmLvrFIYcEsgqF_">, London, UK: IEEE, &#1072;&#1074;&#1075;. 2014, &#1089;&#1089;. 626&ndash;631. doi: 10.1109/SAI.2014.6918252.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839008177&amp;usg=AOvVaw3pB9mBx542f8blCKBmsk7n">[6]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I. Ullah &#1080; Q. H. Mahmoud, &laquo;A hybrid model for anomaly-based intrusion detection in SCADA networks&raquo;, &#1074; </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839008348&amp;usg=AOvVaw2b-Zmd27YDzLmlrW0-Q98T">2017 IEEE International Conference on Big Data (Big Data)</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839008510&amp;usg=AOvVaw2VtFu9FXjrpDaGIsGjKuv0">, Boston, MA: IEEE, &#1076;&#1077;&#1082;. 2017, &#1089;&#1089;. 2160&ndash;2167. doi: 10.1109/BigData.2017.8258164.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839008821&amp;usg=AOvVaw13uDg-hjJjY9HKQ523DE9r">[7]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. V. B. Rakas, M. D. Stojanovic, &#1080; J. D. Markovic-Petrovic, &laquo;A Review of Research Work on Network-Based SCADA Intrusion Detection Systems&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839008975&amp;usg=AOvVaw3Jb5vHcTjqzLPCExyvTfsG">IEEE Access</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839009171&amp;usg=AOvVaw3oYqUUnm8_5kATVN28vEmm">, &#1090;. 8, &#1089;&#1089;. 93083&ndash;93108, 2020, doi: 10.1109/ACCESS.2020.2994961.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839009437&amp;usg=AOvVaw3c6tPhw75Kwxf1SF91LhWm">[8]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;O. A. Alimi, K. Ouahada, A. M. Abu-Mahfouz, S. Rimer, &#1080; K. O. A. Alimi, &laquo;A Review of Research Works on Supervised Learning Algorithms for SCADA Intrusion Detection and Classification&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839009607&amp;usg=AOvVaw1uwMYwAQ9wH2ctLBg9iE6W">Sustainability</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839009771&amp;usg=AOvVaw2objVNLGOcc_8Rr-N-UhRT">, &#1090;. 13, &#1074;&#1099;&#1087;. 17, &#1089;. 9597, &#1072;&#1074;&#1075;. 2021, doi: 10.3390/su13179597.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839010197&amp;usg=AOvVaw3CpWeKcdbs4kZ_cLkLRM6y">[9]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;M. Altaha, J.-M. Lee, A. Muhammad, &#1080; S. Hong, &laquo;An Autoencoder-Based Network Intrusion Detection System for the SCADA System&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839010394&amp;usg=AOvVaw2vAXNV73d1Ez1EiQtsmc04">J. Commun.</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839010546&amp;usg=AOvVaw3QRtLQEL1pQAL0FMNBxAYd">, &#1090;. 16, &#1089;&#1089;. 210&ndash;216, &#1080;&#1102;&#1085;. 2021, doi: 10.12720/jcm.16.6.210-216.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839010820&amp;usg=AOvVaw05hgGBw1xPWjQym3qE79TE">[10]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;J. Qian, X. Du, B. Chen, B. Qu, K. Zeng, &#1080; J. Liu, &laquo;Cyber-Physical Integrated Intrusion Detection Scheme in SCADA System of Process Manufacturing Industry&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839010960&amp;usg=AOvVaw0q_XMy3doQFSVWpDE9h9OT">IEEE Access</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839011103&amp;usg=AOvVaw2usgafl3eTGjbNiJgmVmu0">, &#1090;. 8, &#1089;&#1089;. 147471&ndash;147481, 2020, doi: 10.1109/ACCESS.2020.3015900.</a></span></p><p class="c5"><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839011352&amp;usg=AOvVaw008k2p1RHEcfdDoVuWKHZE">[11]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;C. Sheng, Y. Yao, Q. Fu, &#1080; W. Yang, &laquo;A cyber-physical model for SCADA system and its intrusion detection&raquo;, </a></span><span class="c1 c6"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839011520&amp;usg=AOvVaw0d4WnNkjU3rhaSYdVV69PF">Comput. Netw.</a></span><span class="c1"><a class="c2" href="https://www.google.com/url?q=https://www.zotero.org/google-docs/?Vq0AHl&amp;sa=D&amp;source=editors&amp;ust=1710401839011688&amp;usg=AOvVaw2fuQteFH07zXx4ugGWEPla">, &#1090;. 185, &#1089;. 107677, &#1092;&#1077;&#1074;. 2021, doi: 10.1016/j.comnet.2020.107677.</a></span></p><p class="c4 c10"><span class="c0"></span></p><p class="c4"><span class="c0">&nbsp;</span></p><p class="c10 c15"><span class="c0"></span></p></body></html>